src/codesets/url/INCLUDES_url_VIERA/params_setvolume.txt

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
 <s:Body>
  <u:SetVolume xmlns:u="schemas-upnp-org:service:RenderingControl:1">
   <InstanceID>0</InstanceID>
   <Channel>Master</Channel>
   <DesiredVolume>$cvar(volumetoset)</DesiredVolume>
  </u:SetVolume>
 </s:Body> 
</s:Envelope>